// src/utils/changzhengGroute.ts
// 这里是获取到的红1长征路线经纬度坐标数组
 export const changzheng1Coordinates = [
    // 这里需要替换为实际的长征路线坐标数据
    [116.026667, 25.885556], // 江西瑞金（起点）
    [115.415833, 25.957500],//江西于都县（中央红军主力渡过于都河）
    [113.685000, 25.548889],//湖南汝城县（突破第一道封锁线）
    [112.950000, 25.400000],//湖南宜章县（突破第二道封锁线）
    [111.600000, 25.533333],//湖南道县（突破第四道封锁线）
    [111.073889, 25.929444],//广西全州县（湘江战役核心区）
    [109.138611, 26.230556],//贵州黎平县
    [107.471111, 27.068889],//贵州瓮安县（突破乌江前哨战）
    [106.918056, 27.698611],//贵州遵义（遵义会议）
    [106.816667, 28.133333],//贵州桐梓县（娄山关战役前集结地）
    [106.203889, 28.325833],//贵州习水县土城镇（一渡赤水起点）
    [105.813333, 28.196389],//湖南宜章县四川古蔺县太平镇（二渡赤水西岸节点）
    [105.048611, 27.847222],//云南威信县扎西镇（扎西会议，整编部队）
    [106.370000, 27.860000],//贵州仁怀市茅台镇（三渡赤水渡口）
    [106.216667, 27.533333],//贵州金沙县后山镇（四渡赤水东岸节点）
    [102.833333, 26.183333],//云南禄劝县皎平渡（巧渡金沙江主渡口）
    [102.244444, 26.658333],//四川会理县（会理会议，休整北进）
    [102.166667, 28.550000],//四川冕宁县（彝海结盟，通过彝族区）
    [102.500000, 29.466667],//四川石棉县安顺场（强渡大渡河）
    [102.232778, 29.914722],//四川泸定桥（飞夺泸定桥）
    [102.816667, 30.366667],//四川宝兴县（翻越夹金山（雪山）起点）
    [102.366667, 31.016667],//四川懋功县（与红四方面军会师（达维会师））
    [103.600000, 32.533333],//四川松潘县毛尔盖镇（毛尔盖会议，过草地决策）
    [102.966667, 33.575000],//四川若尔盖县班佑村（穿越草地后第一落脚点）
    [103.800000, 34.100000],//甘肃迭部县腊子口（突破腊子口天险）
    [105.283333, 35.208333],//甘肃通渭县榜罗镇（榜罗镇会议，确定陕北落脚点）
    [108.175000, 36.927500]  // 陕西吴起镇（会师终点）
];

// 这里是获取到的红2长征路线经纬度坐标数组
export const changzheng2Coordinates = [
    [109.644167, 29.399722],// 湖南桑植县（起点）
    [109.850000, 28.999722],//湖南永顺县
    [109.443056, 29.457500],//湖南龙山县
    [109.138056, 29.680833],//湖北咸丰县
    [108.228333, 27.517222],//贵州石阡县
    [107.471111, 27.068889],//贵州瓮安县
    [106.591667, 26.838889],//贵州修文县
    [104.644167, 25.709444],//贵州盘县（今盘州市）
    [104.105556, 26.227222],//云南宣威市
    [103.258333, 25.558889],//云南寻甸县
    [99.773333, 26.901667],//云南丽江市石鼓镇
    [99.800000, 28.933333],//四川乡城县
    [100.269722, 29.991944],//四川理塘县
    [99.991667, 31.623333],//四川甘孜县
    [101.700833, 32.902222],//四川阿坝县
    [104.032500, 34.438056],//甘肃岷县
    [105.073056, 35.692500],//云南宣威市
];